src/InformationRegisters/ОповещениеМониторингКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОповещениеМониторингКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Старт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОкна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОповещения</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ОповещениеМониторингКлиента/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция, получает текущие задачи для пользователя определенных временем срабатывания.
//
Функция ПолучитьАктивныеОповещенияКлиента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОповещениеМониторингКлиента.Старт КАК Старт,
	|	ОповещениеМониторингКлиента.ПериодОповещения КАК ПериодОповещения,
	|	ОповещениеМониторингКлиента.ОбъектОповещения КАК ОбъектОповещения,
	|	ОповещениеМониторингКлиента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОповещениеМониторингКлиента.Ключ КАК Ключ,
	|	ОповещениеМониторингКлиента.ЗаголовокОкна КАК ЗаголовокОкна,
	|	ОповещениеМониторингКлиента.Сообщение КАК Сообщение,
	|	ОповещениеМониторингКлиента.Параметр_1 КАК Параметр_1,
	|	ОповещениеМониторингКлиента.Параметр_2 КАК Параметр_2,
	|	ОповещениеМониторингКлиента.Параметр_3 КАК Параметр_3,
	|	ОповещениеМониторингКлиента.Параметр_4 КАК Параметр_4,
	|	ОповещениеМониторингКлиента.Параметр_5 КАК Параметр_5
	|ИЗ
	|	РегистрСведений.ОповещениеМониторингКлиента КАК ОповещениеМониторингКлиента
	|ГДЕ
	|	ОповещениеМониторингКлиента.Старт <= &ТекущаяДата
	|	И ВЫБОР
	|			КОГДА ОповещениеМониторингКлиента.ПериодОповещения > 0
	|				ТОГДА &ТекущаяДата <= ДОБАВИТЬКДАТЕ(ОповещениеМониторингКлиента.Старт, СЕКУНДА, ОповещениеМониторингКлиента.ПериодОповещения)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ОповещениеМониторингКлиента.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ОповещениеМониторингКлиента.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.Сотрудники)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &ТекущийСотрудник
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.Пользователи)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &ТекущийПользователь
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(Справочник.РабочиеМеста)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &РабочееМесто
	|			КОГДА ТИПЗНАЧЕНИЯ(ОповещениеМониторингКлиента.ОбъектОповещения) = ТИП(ЧИСЛО)
	|				ТОГДА ОповещениеМониторингКлиента.ОбъектОповещения = &НомерСеанса
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ");	
	
	//И ОповещениеМониторингКлиента.ОбъектОповещения = &НомерСеанса");
	
	Запрос.УстановитьПараметр("ТекущаяДата"		   , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НомерСеанса"		   , НомерСеансаИнформационнойБазы());
	Запрос.УстановитьПараметр("РабочееМесто"       , ПараметрыСеанса.РабочееМестоКлиента);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущийСотрудник"   , ПараметрыСеанса.ТекущийСотрудник);	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицуЗначенийВМассивСтруктур(Результат);
   
КонецФункции

// Процедура, очищает устаревшие оповещения клиента.
//
Процедура ОчиститьУстаревшиеОповещенияКлиента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.ОповещениеМониторингКлиента КАК ОповещениеМониторингКлиента
	|ГДЕ
	|	ОповещениеМониторингКлиента.Старт <= &ТекущаяДата
	|	И (РАЗНОСТЬДАТ(ОповещениеМониторингКлиента.Старт, &ТекущаяДата, ДЕНЬ) >= 2
	|		ИЛИ ОповещениеМониторингКлиента.ПериодОповещения > 0
	|			И ДОБАВИТЬКДАТЕ(ОповещениеМониторингКлиента.Старт, СЕКУНДА, ОповещениеМониторингКлиента.ПериодОповещения) <= &ТекущаяДата)");
	
    Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЗ ИЗ Результат Цикл
		ОповещениеМониторингКлиентаМенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ОповещениеМониторингКлиентаМенеджерЗаписи, СтрокаТЗ);
		ОповещениеМониторингКлиентаМенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Процедура, добавляет оповещение клиента.
//
Процедура ДобавитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ, Старт = Неопределено, ПериодОповещения = 0, ЗаголовокОкна = "", Сообщение = "", МассивПараметров = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= СтруктурнаяЕдиница;
	МенеджерЗаписи.Ключ 				= Ключ;
	
	МенеджерЗаписи.Старт 				= ?(ЗначениеЗаполнено(Старт), Старт, ТекущаяДата());
	МенеджерЗаписи.ПериодОповещения 	= ПериодОповещения;
	
	МенеджерЗаписи.ЗаголовокОкна 		= ЗаголовокОкна;
	МенеджерЗаписи.Сообщение			= Сообщение;
	
	Если МассивПараметров <> Неопределено Тогда
		
		Счетчик = 0;
		Для Каждого ЭлементПараметра Из МассивПараметров Цикл
			Счетчик = Счетчик + 1;
			МенеджерЗаписи["Параметр_" + Счетчик]	= ЭлементПараметра;
		КонецЦикла;
		
	КонецЕсли; 
	
	МенеджерЗаписи.Записать();
   
КонецПроцедуры

// Процедура, завершает оповещение клиента.
//
Процедура ЗавершитьОповещениеКлиента(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	МенеджерЗаписи.Ключ 				= Ключ;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
   
КонецПроцедуры

// Процедура, переводит оповещение на 10 секуд вперед.
// 
// Описание: переводит оповещение на 10 секунд вперед и уменьшаяет время жизини оповещения.
//			 Это требуется, что бы оповещене показывалось на время жизни, т.к. само по себе оно быстро скрывается.
//
Процедура ПеревестиОповещениеКлиентаНа10Сек(ОбъектОповещения, СтруктурнаяЕдиница = Неопределено, Ключ) Экспорт
	
	НачатьТранзакцию();
	
	УстановитьБлокировкуДанных(ОбъектОповещения, СтруктурнаяЕдиница, Ключ);
	
	МенеджерЗаписи = РегистрыСведений.ОповещениеМониторингКлиента.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ОбъектОповещения 	= ОбъектОповещения;
	МенеджерЗаписи.СтруктурнаяЕдиница 	= ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	МенеджерЗаписи.Ключ 				= Ключ;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Старт 		= ТекущаяДатаСеанса() + 9;
		//МенеджерЗаписи.ОповещатьДо 	= МенеджерЗаписи.ОповещатьДо - 10;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура, устанавливает блокировку данных.
//
Процедура УстановитьБлокировкуДанных(ОбъектОповещения, СтруктурнаяЕдиница, Ключ)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОповещениеМониторингКлиента");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ОбъектОповещения", ОбъектОповещения);
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		ЭлементБлокировки.УстановитьЗначение("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	КонецЕсли;
	
	ЭлементБлокировки.УстановитьЗначение("Ключ", Ключ);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

#КонецОбласти
